"""
Упражнение 3.
Дана строка s и символ k. Реализуйте функцию, рисующую рамку из символа k вокруг данной строки, например:

**************
*Текст в рамке*
**************
"""


def run_task_03():
    s = 'Длинный текст в рамке'
    k = '?'
    border_str = "".join([k for _ in range(len(s) + 2)])
    result = (border_str + '\n'
              + k + s + k + '\n'
              + border_str)
    print(result)
